# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'nano' # Latest nano version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gnu-sed'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'midnight-commander'
brew 'duf'
brew 'dog'
brew 'neofetch'
brew 'wget'
brew 'fd'
brew 'ripgrep'
brew 'python@3.12'
brew 'eza'

# Apps
cask 'font-hack-nerd-font'
cask '1password'
cask 'brave-browser'
cask 'discord'
cask 'github'
cask 'imageoptim'
cask 'visual-studio-code'
cask 'calibre'
cask 'textmate'
cask 'mediainfo'
cask 'iina'
cask 'hiddenbar'
cask 'filebot'
cask 'glance'
cask 'reverso'
cask 'keybase'
#cask 'mp3tag'
cask 'adguard'
cask 'onlyoffice'
cask 'megasync'

# Mac App Store
mas 'Mp3tag', id: 1532597159
mas '1Password for Safari', id: 1569813296
mas 'Hover for Safari', id: 1540705431
#mas 'AdGuard for Safari', id: 1440147259 
mas 'WhatsApp Messenger', id: 310633997
mas 'News Explorer', id: 1032670789
mas 'Search Engines for Safari', id: 1588019370

