# Taps
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'nano' # Latest nano version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gnu-sed'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'midnight-commander'
brew 'duf'
brew 'dog'
brew 'neofetch'
brew 'wget'
brew 'fd'
brew 'ripgrep'
brew 'python@3.12'
brew 'eza'
brew 'swift-quit'

# Apps
cask 'font-hack-nerd-font'
cask '1password'
#cask 'brave-browser'
cask 'discord'
cask 'github'
cask 'imageoptim'
cask 'visual-studio-code'
cask 'calibre'
cask 'iina'
cask 'filebot'
cask 'glance'
cask 'reverso'
cask 'keybase'
cask 'megasync'
#cask 'alfred'
cask 'keka'
cask 'quitter'
cask 'floorp'

# Mac App Store
mas 'Mp3tag', id: 1532597159
mas '1Password for Safari', id: 1569813296
mas 'Magnet', id: 441258766
mas 'Microsoft OneNote', id: 784801555
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'MediaInfo', id: 510620098
mas 'Hover for Safari', id: 1540705431
#mas 'AdGuard for Safari', id: 1440147259 
mas 'WhatsApp Messenger', id: 310633997
mas 'News Explorer', id: 1032670789
mas 'Search Engines for Safari', id: 1588019370
mas 'DeArrow', id: 6451469297
mas 'CustomSearch', id: 1588019370
mas 'SponsorBlock', id: 1573461917
mas 'Hidden Bar', id: 1452453066
mas 'Telegram Lite', id: 946399090
mas 'CotEditor', id: 1024640650
